Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes Constructor
 Initializes a new instance of the PlacingDistanceAttributes class. The default values are a 0.0 search margin and a 0.0 minimal distance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDistanceAttributes()
Public Sub New
See Also
Reference
PlacingDistanceAttributes Class
PlacingDistanceAttributes Overload
Tekla.Structures.Drawing Namespace